Учет_кабельной_продукции/src/Catalogs/ЖурналыУчетаКабельнойПродукции/ЖурналыУчетаКабельнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЖурналыУчетаКабельнойПродукции</name>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Объекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукцииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Трассировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КабельныеЛинии</name>
    <attributes>
      <name>Изм</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КабельнаяЛиния</name>
      <type>
        <types>CatalogRef.КабельныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНитки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОткудаПомещение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОткудаОборудование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обозначени1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОткудаКоординаты</name>
      <type>
        <types>CatalogRef.Координаты</types>
      </type>
    </attributes>
    <attributes>
      <name>КудаПомещение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КудаОборудование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обозначение2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КудаКоординаты</name>
      <type>
        <types>CatalogRef.Координаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаПроектная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаФактическая</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проверена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МаркировкаКабеля</name>
      <type>
        <types>CatalogRef.МаркиКабели</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Учет_кабельной_продукции/src/Catalogs/ЖурналыУчетаКабельнойПродукции/Forms/ФормаСправочникаДляРабочегоМеста/Module.bsl
#Область СобытияФормы
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);	
	
	//РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);

КонецПроцедуры
#КонецОбласти	 


#Область ПодключаемыеКомандыБСП 
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)    
	
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);  
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры)

	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);	
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)   
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект); 
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()   
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);   
	
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура ВыбратьПроект(Команда)
	
	ПараметрыФормыВыбора = ПолучитьПараметрыФормыВыбора();		
	ДопПараметры         = Новый Структура("ИмяРеквизита", "Проект");
	
	ОткрытьФорму("Справочник.Проекты.ФормаВыбора", ПараметрыФормыВыбора, 
		ЭтаФорма,,,, Новый ОписаниеОповещения("ВыбратьЗавершение", ЭтотОбъект, ДопПараметры));
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКабельнаяЛиния(Команда)

	ПараметрыФормыВыбора = ПолучитьПараметрыФормыВыбора();	
	ДопПараметры         = Новый Структура("ИмяРеквизита", "КабельнаяЛиния");
	
	ОткрытьФорму("Справочник.КабельныеЛинии.ФормаВыбора", ПараметрыФормыВыбора, 
		ЭтаФорма,,,, Новый ОписаниеОповещения("ВыбратьЗавершение", ЭтотОбъект, ДопПараметры));		
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыФормыВыбора()

	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимОткрытияОкна",  РежимОткрытияОкнаФормы.Независимый);
	ПараметрыФормыВыбора.Вставить("РежимВыбора",        Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Ложь);
	
	Возврат ПараметрыФормыВыбора;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда		
		Если ДополнительныеПараметры.Свойство("ИмяРеквизита") Тогда

			Объект[ДополнительныеПараметры.ИмяРеквизита] = Результат;
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура НомерПППриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура НомерВКПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура РазпешитьМонтажПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
